BORDER ROUTER:
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#inter
Router(config)#interface gig
Router(config)#interface gigabitEthernet0/0
Router(config-if)#ip?
ip  ipv6  
Router(config-if)#ip addr
Router(config-if)#ip address 172.16.16.1 255.255.255.252
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#inter
Router(config)#interface se
Router(config)#inte
Router(config)#interface se
Router(config)#interface serial0/0/0
Router(config-if)#ip addre
Router(config-if)#ip address 192.168.10.5 255.255.255.252
Router(config-if)#no sh

%LINK-5-CHANGED: Interface Serial0/0/0, changed state to down
Router(config-if)#exit

Router(config)#interfa
Router(config)#interface se
Router(config)#interface serial 0/0/1
Router(config-if)#ip add
Router(config-if)#ip address 192.168.10.1 255.255.255.252
Router(config-if)#no sh

%LINK-5-CHANGED: Interface Serial0/0/1, changed state to down
Router(config-if)#
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname halozat.com
halozat.com(config)#enable password sshpass
halozat.com(config)#username?
username  
halozat.com(config)#line vty 0 4
halozat.com(config-line)#password sshpass
halozat.com(config-line)#login
halozat.com(config-line)#login lo
halozat.com(config-line)#login local 
halozat.com(config-line)#transport
halozat.com(config-line)#transport in
halozat.com(config-line)#transport input telne
halozat.com(config-line)#transport input telnet / 
halozat.com(config-line)#transport input ssh
halozat.com(config-line)#exit
halozat.com(config)#ip domain name halozat.com
halozat.com(config)#crypt
halozat.com(config)#crypto key
halozat.com(config)#crypto key gener
halozat.com(config)#crypto key generate rsa
The name for the keys will be: halozat.com.halozat.com
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1024
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]

halozat.com(config)#exit
*Mar 1 1:33:32.330: %SSH-5-ENABLED: SSH 1.99 has been enabled
halozat.com#
%SYS-5-CONFIG_I: Configured from console by console






IRODA1
Router>en
Router#conft
Translating "conft"...domain server (255.255.255.255) % Name lookup aborted
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interf
Router(config)#interface se
Router(config)#interface serial 0/0/0
Router(config-if)#ip add
Router(config-if)#ip address 192.168.10.6 255.255.255.252
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface Serial0/0/0, changed state to up

Router#
%SYS-5-CONFIG_I: Configured from console by console

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/0, changed state to up
Router(config-if)#exit
Router(config)#interface
Router(config)#interface gig
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#ip addre
Router(config-if)#ip address 192.168.50.1 255.255.255.128
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up
Router(config-if)#exit
Router(config)#interface gig
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#ip address 192.168.50.129 255.255.255.224
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up
